<!DOCTYPE html>
<html>
<head>
	<title>اللغات</title>
</head>
<body>
	<?php include('common/header.php') ?>
	<div class="container-fluid ">
		<div class="row mb-5">
			<div class="academic-area-headings ">
				<h4 class="py-4 ">موقع ادارة المتدربين</h4>
			</div>
			<div class="container">
			<h4 class="dean-message-heading mt-3 ">رسالة العميد</h4>
				<div class="row ">
					<div class="col-lg-12 text-end">
						<p>
					
						إنه لمن دواعي سروري أن نرحب بالمرشحين المحتملين وأولياء أمورهم / أولياء أمورهم في التكنولوجيا  التي تتألف من اربع أقسام للكمبيوتر أي الذكاء الاصطناعي والبايثون والفلتر والجافا. يعد اختيار مؤسسة الكورس قرارًا مهمًا يتعين عليك اتخاذه، والغرض الأساسي من المعلومات الواردة في هذه النشرة هو إعطاء فكرة عما قد تكون عليه الدراسة  . اسمحوا لي أن أؤكد لكم أننا نقدم التعليم لعلوم الحاسب على قدم المساواة مع جميع الكورسات الأخرى وجميع برامج الكورسات الثلاثة معتمدة من قبل مجلس الهندسة الامريكي ومعترف بها من قبل لجنة التعليم العالي في مصر تسعى  دائمًا إلى تمكين الخريجين بالمعرفة والمهارات.
ضروري لسوق العمل الحالي. تمت إعادة النظر في المنهج مؤخرًا لمواءمته مع نظام التعليم القائم على النتائج ، والمتطلبات الضرورية لاتفاق مصر . وبسبب مبادرة ، أصبحت مصر من الموقعين الكاملين على اتفاقية، مما يعني تكافؤًا كبيرًا في المؤهلات علوم الحاسب بين الدول الموقعة والتنقل المتبادل لهندسة الكمبيوتر في السوق الدولية. سيكون تركيز تعليمنا الهندسية الحاسبات والمعلومات من الآن فصاعدًا على تحسين المهارات الشخصية ومستوى الثقة لدى الخريجين وتشجيعهم على الظهور كرواد أعمال قادرين على توليد الثروة.
إن أعضاء هيئة التدريس المؤهلين والمتفانين والمختصين، والمختبرات المجهزة تجهيزًا جيدًا،  تضيف قيمة إلى الدورات التي تجريها الأقسام. يقع الكورس في موقع مركزي شديد الخضرة ويمكن الوصول إليه بسهولة من أي ركن في المنصورة. تتحد البنية التحتية والجو لتوفير بيئة تركيز رائعة. مرحبًا بك في الشهور الأكثر إشباعًا وتعلمًا في حياتك.					
</p>

					</div>	
				</div>
			</div>
		</div>
	</div>
	<div class="container-fluid">
		<div class="row mb-5">
			<div class="academic-area-headings">
				<h4 class="py-4">الذكاء الاصطناعي</h4>
			</div>
			<div class="container">
			<h4 class="dean-message-heading mt-3">مكونات ومزاياواهم معلومات عن الذكاء الاصطناعي</h4>

				<div class="row">
					
					<div class="col-lg-12 text-end">
						تغلب على المشكلات المعقدة يمكن لتقنية الذكاء الاصطناعي استخدام تعلّم الآلة وشبكات التعليم العميق في حل المشكلات المعقدة بذكاء يشبه ذكاء العنصر البشري					
						الطبقة الأولى: طبقة البيانات
						الذكاء الاصطناعي يعتمد على تقنيات مختلفة مثل تعلّم الآلة، ومعالجة اللغة الطبيعية، والتعرف على الصور. تمثل البيانات محور هذه التقنيات
						الطبقة الثانية: أطر تعلّم الآلة وطبقة الخوارزمية 
						ينشئ المهندسون بالتعاون مع علماء البيانات أطر تعلّم الآلة لتلبية متطلبات حالات معينة من حالات استخدام الأعمال
						</p>
					</div>	
				</div>
			</div>

		</div>
	</div>
	<div class="container-fluid">
		<div class="row mb-5">
			<div class="academic-area-headings">
				<h4 class="py-4">البايثون</h4>
			</div>
			<div class="container">
			<h4 class="dean-message-heading mt-3">مكونات ومزايا واهم معلومات عن  البايثون</h4>

				<div class="row">
					<div class="col-lg-12 text-justify">
						<p>
						هي لغة برمجة تُستخدم على نطاق واسع في تطبيقات الشبكة وتطوير البرامج وعلم البيانات والتعلم python 					
						يمكن للمطورين قراءة برنامج بايثون وفهمه بسهولة إذ يتضمن بناء بسيط للجملة يشبه اللغة الإنجليزية
						تجعل بايثون المطورين أكثر إنتاجية إذ يستطيعون كتابة برنامج بايثون باستخدام سطور رموز أقل مقارنةً بكثير من اللغات الأخرى.
تتمتع بايثون بمكتبة قياسية كبيرة تتضمن تعليمات برمجية قابلة لإعادة الاستخدام لأي مهمة تقريبًا. ونتيجةً لذلك، لا يضطر المطورون إلى كتابة تعليمة برمجية من البداية.		
				</p>
					</div>	
				</div>
			</div>
		</div>
	</div>
	<div class="container-fluid">
		<div class="row mb-5">
			<div class="academic-area-headings">
				<h4 class="py-4">فلتر</h4>
			</div>
			<div class="container">
			<h4 class="dean-message-heading mt-3">مكونات ومزايا واهم معلومات عن فلتر </h4>

				<div class="row">
					<div class="col-lg-12 text-justify">
						<p>
						الفلتر عبارة عن إطار عمل مفتوح المصدر تطوّره جوجل وتدعمه. يستخدم مطورو الواجهة الأمامية والمطورون الشاملون الفلتر لإنشاء واجهة مستخدم (مصمم الوجهات الداخلية) للتطبيق تعمل على منصات متعددة بتعليمة برمجية أساسية واحدة				
						تطوير التطبيقات الأصلية
						نظرًا إلى أن المطورين يكتبون رموز منصة معينة في تطوير التطبيقات الأصلية، فإنهم يتمتعون بوصول كامل إلى وظائف الجهاز الأصلية. وهذا ينتج عنه عمومًا أداء وسرعة أعلى مقارنةً بتطوير التطبيقات في مختلف المنصات
						من ناحية أخرى، إذا كنت ترغب في تشغيل تطبيق على عدة منصات، فإن تطوير التطبيق الأصلي يتطلب رموزًا أكثر ومطورين أكثر. بالإضافة إلى هذه النفقات، قد يجعل تطوير التطبيقات المحلية من الصعب إطلاقها على منصات مختلفة في الوقت نفسه ذات تجربة مستخدم متسقة. وهنا تظهر أهمية أطر عمل تطوير التطبيقات في مختلف المنصات						
</p>
					</div>	
				</div>
			</div>
		</div>
	</div>	
	<div class="container-fluid">
		<div class="row mb-5">
			<div class="academic-area-headings">
				<h4 class="py-4">الجافا</h4>
			</div>
			<div class="container">
			<h4 class="dean-message-heading mt-3">مكونات ومزايا واهم معلومات عن الجافا</h4>

				<div class="row">
					<div class="col-lg-12 text-end ">
						<p style="text-end">
						تدعم مفهوم البرمجة الشيئية (البرمجة كائنية التوجه).

					 تتميز لغة جافا بمميزات خاصة مما يجعلها أكثر لغات البرمجة إثارة						</p>
						<p>

سهولة الحصول عليها.
امنة
قابلة للنقل والتنفيذ.
إضافة الحركة والصوت إلى صفحات الويب.
كتابة الألعاب والبرامج المساعدة.
إنشاء برامج ذات واجهة مستخدم رسومية.
تصميم برمجيات تستفيد من كل مميزات الأنترنت. توفر لغة الجافا بيئة تفاعلية عبر الشبكة العنكبوتية وبالتالي تستعمل لكتابة برامج تعليمية للإنترنت عبر برمجيات المحاكاة الحاسوبية للتجارب العلمية وبرمجيات الفصول الافتراضية للتعليم الإلكتروني والتعليم عن بعد. لا تنحصر فاعلية الجافا في الشبكة العنكبوتية فقط بل تمكننا من إنشاء برامج للاستعمال الشخصي والمهني، هذه البرامج تنجز عبر جملة من البرامج التي تسهل كتابة الأوامر كبرنامج نت بينز وإكلبس
مفسر: تتطلب بعض لغات البرمجة مفسرا يقوم بتفسير كل سطر من البرنامج ويبلغ الحاسب بالمهام التي يتعين عليه القيام بها ومن هذه اللغات لغة البيسك وتتميز اللغات التي تحتاج مفسرا بسهولة اختبارها ولكن يعيبها أنها تكون بطيئة عند تشغيلها.			
			</p>	
					</div>	
				</div>
			</div>
		</div>
	</div>
</body>
</html>